In [5]:
import numpy as np
import pandas as pd

In [7]:
from numpy.random import randn
np.random.seed(101)

In [9]:
df = pd.DataFrame(randn(5,4), ['A','B','C','E','D'], ['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
E  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [11]:
df['X']

A    0.628133
B   -0.319318
C    0.740122
E   -0.758872
D    1.978757
Name: X, dtype: float64

In [13]:
type(df) #Dataframe is a sett of series

pandas.core.frame.DataFrame

In [15]:
type(df['X'])

pandas.core.series.Series

In [17]:
# Add new column

df['new'] = df['W'] + df['X']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
E  0.188695 -0.758872 -0.933237  0.955057 -0.570177
D  0.190794  1.978757  2.605967  0.683509  2.169552

In [19]:
df.drop('new', axis = 1) #Drop used for removing column or rows

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
E  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [21]:
df.drop('C', axis = 0) #The changes won't stick until we use inplace argument, as 'new' appears again

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
E  0.188695 -0.758872 -0.933237  0.955057 -0.570177
D  0.190794  1.978757  2.605967  0.683509  2.169552

In [23]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.334983
B  0.651118 -0.319318 -0.848077  0.605965  0.331800
C -2.018168  0.740122  0.528813 -0.589001 -1.278046
E  0.188695 -0.758872 -0.933237  0.955057 -0.570177
D  0.190794  1.978757  2.605967  0.683509  2.169552

In [25]:
# changes will stick now
df.drop('new', axis = 1, inplace=True)
df.drop('C', axis = 0, inplace=True)
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
E  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [27]:
#Selecting Rows 
df.loc['A'] #location

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [29]:
df.iloc[0] #index location

W    2.706850
X    0.628133
Y    0.907969
Z    0.503826
Name: A, dtype: float64

In [31]:
#Selecting a single value from data drame
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
E  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [43]:
df.loc['A','X']

0.6281327087844596

In [33]:
#selecting subsets of values
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
E  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [35]:
df.loc[['A','B','E'], ['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965
E -0.758872  0.955057

In [37]:
#conditional operations in DataFrames

booldf = df > 0
booldf

      W      X      Y     Z
A  True   True   True  True
B  True  False  False  True
E  True  False  False  True
D  True   True   True  True

In [39]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
E  0.188695       NaN       NaN  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [41]:
df[df>0] #another way

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
E  0.188695       NaN       NaN  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [43]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
E  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [45]:
df['X'] > 0

A     True
B    False
E    False
D     True
Name: X, dtype: bool

In [47]:
df[df['X'] > 0] #rows which are greater than zero in X col

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.190794  1.978757  2.605967  0.683509

In [57]:
#I need only Y col from above df then,

df[df['X'] > 0]['Y']

A    0.907969
D    2.605967
Name: Y, dtype: float64

In [59]:
df[df['X'] > 0][['Y','Z']]

          Y         Z
A  0.907969  0.503826
D  2.605967  0.683509

In [61]:
#multiple conditions

df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
E  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [65]:
df[(df['X'] > 0) & (df['Y'] > 2)]

          W         X         Y         Z
D  0.190794  1.978757  2.605967  0.683509

In [67]:
df[(df['X'] > 0) | (df['Y'] > 2)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
D  0.190794  1.978757  2.605967  0.683509

In [69]:
#Resetting and Setting index

df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
E  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [71]:
df.reset_index() #Data will not loss untill inplace != True

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     E  0.188695 -0.758872 -0.933237  0.955057
3     D  0.190794  1.978757  2.605967  0.683509

In [73]:
df #Data will not loss untill inplace = True is not passed as arg

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
E  0.188695 -0.758872 -0.933237  0.955057
D  0.190794  1.978757  2.605967  0.683509

In [75]:
#setting a new col as new index
NewIndex = 'PK IND CH IR'.split()

In [77]:
NewIndex

['PK', 'IND', 'CH', 'IR']

In [79]:
df['NewIndex'] = NewIndex

In [81]:
df

          W         X         Y         Z NewIndex
A  2.706850  0.628133  0.907969  0.503826       PK
B  0.651118 -0.319318 -0.848077  0.605965      IND
E  0.188695 -0.758872 -0.933237  0.955057       CH
D  0.190794  1.978757  2.605967  0.683509       IR

In [85]:
df.set_index('NewIndex')

                 W         X         Y         Z
NewIndex
PK        2.706850  0.628133  0.907969  0.503826
IND       0.651118 -0.319318 -0.848077  0.605965
CH        0.188695 -0.758872 -0.933237  0.955057
IR        0.190794  1.978757  2.605967  0.683509

In [87]:
df #as inplace = True is not passes, data is not lost

          W         X         Y         Z NewIndex
A  2.706850  0.628133  0.907969  0.503826       PK
B  0.651118 -0.319318 -0.848077  0.605965      IND
E  0.188695 -0.758872 -0.933237  0.955057       CH
D  0.190794  1.978757  2.605967  0.683509       IR